app/Controllers/Clientes.php

    public function list(){
        $clientesModel = new ClientesModel();
        $clientes = $clientesModel->paginate(10);
---
SELECT *
FROM `clientes`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `clientes`

    public function details(int $id){
        $clienteModel = new ClientesModel();
        $cliente = $clienteModel->find($id);
---
SELECT *
FROM `clientes`
WHERE `clientes`.`id` = 1