app/Controllers/Propostas.php

    public function list(){
        $propostasModel = new PropostasModel();
        $propostas = $propostasModel->select('propostas.id, cliente_id, produto, valor_mensal, origem, versao, status, clientes.nome as cliente_nome')
        ->join('clientes', 'propostas.cliente_id = clientes.id' )
        ->where('propostas.deleted_at IS NULL', null, false)
        ->paginate(10);
---
SELECT COUNT(*) AS `numrows`
FROM `propostas`
JOIN `clientes` ON `propostas`.`cliente_id` = `clientes`.`id`
WHERE propostas.deleted_at IS NULL
SELECT `propostas`.`id`, `cliente_id`, `produto`, `valor_mensal`, `origem`, `versao`, `status`, `clientes`.`nome` as `cliente_nome`
FROM `propostas`
JOIN `clientes` ON `propostas`.`cliente_id` = `clientes`.`id`
WHERE propostas.deleted_at IS NULL
 LIMIT 10

    public function details(int $id){
        $propostasModel = new PropostasModel();
        $propostas = $propostasModel->select('propostas.id, cliente_id, produto, valor_mensal, origem, versao, status, clientes.nome as cliente_nome')
        ->join('clientes', 'propostas.cliente_id = clientes.id')
        ->find($id);
---
SELECT `propostas`.`id`, `cliente_id`, `produto`, `valor_mensal`, `origem`, `versao`, `status`, `clientes`.`nome` as `cliente_nome`
FROM `propostas`
JOIN `clientes` ON `propostas`.`cliente_id` = `clientes`.`id`
WHERE `propostas`.`id` = 1

    public function save($id = null){
        $propostasModel = new PropostasModel();
        if(is_numeric($id)){
            $old = $propostasModel->where('id', $id)->findAll();
            $data = $this->request->getRawInput();
            $proposta = [
                'cliente_id' => $data['proposta_cliente_id'],
                'produto' => $data['proposta_produto'],
                'valor_mensal' => $data['proposta_valor_mensal'],
                'origem' => $data['proposta_origem'],
                'status' => $data['proposta_status'],
                'versao' => $data['proposta_versao'] + 1,
            ];
            try{
                if($old['versao'] != $data['proposta_versao'])
                    throw new Exception('Erro de versão');

                $propostasModel->update($data['proposta_id'], $proposta);
                $new = $propostasModel->where('id', $id)->findAll();
---
SELECT *
FROM `propostas`
WHERE `id` = '2'
UPDATE `propostas` SET `cliente_id` = '2', `produto` = 'aspernatura', `valor_mensal` = '232.59', `origem` = 'SITE', `status` = 'CANCELED', `versao` = 1007402599
WHERE `propostas`.`id` IN ('2')

    public function newLog($old = array(), $new = array()){
        $propostaLogModel = new PropostasLogModel();
        $data = [
            'proposta_id' => $new['id'],
            'actor' => 1,
        ];
        if(empty($old))
            $data['evento'] = "CREATED";
        else if(
            $old['produto'] != $new['produto'] ||
            $old['valor_mensal'] != $new['valor_mensal'] ||
            $old['origem'] != $new['origem']
        )
            $data['evento'] = "UPDATED_FIELDS";

        $payload = [];
        if($old['produto'] != $new['produto'])
            $payload['produto'] = ['antigo' => $old['produto'], 'novo' => $new['produto']];

        if($old['valor_mensal'] != $new['valor_mensal'])
            $payload['valor_mensal'] = ['antigo' => $old['valor_mensal'], 'novo' => $new['valor_mensal']];

        if($old['origem'] != $new['origem'])
            $payload['origem'] = ['antigo' => $old['origem'], 'novo' => $new['origem']];

        if(!empty($payload)){
            $data['payload'] = json_encode($payload);
            //INSERE LOG DE ALTERAÇÂO
            $propostaLogModel->insert($data);
---
INSERT INTO `propostas_log` (`proposta_id`, `actor`, `evento`, `payload`) VALUES ('2', 1, 'STATUS_CHANGED', '{\"status\":{\"antigo\":\"APPROVED\",\"novo\":\"\"}}')