app/Controllers/PropostasLog.php

SELECT *
FROM `propostas_log`
WHERE `proposta_id` = '2'
---
    public function auditoria($id = null){
        $propostasLogModel = new PropostasLogModel();
        $pLogs = $propostasLogModel->where("proposta_id", $id)->findAll();